MMLU = """
ᠲᠠ ᠬᠡᠳᠦᠨ ᠣᠯᠠᠨ ᠰᠤᠩᠭᠤᠭᠳᠠᠬᠤᠨ᠎ᠲᠠᠢ ᠰᠣᠩᠭᠣᠯᠲᠠ᠎ᠶ᠋ᠢᠨ ᠰᠡᠳᠦᠪ᠎ᠢ᠋ ᠣᠯᠬᠤ ᠪᠣᠯᠤᠨ᠎ᠠ ᠃ ᠰᠡᠳᠦᠪ ᠨᠢᠭᠡᠪᠦᠷᠢ᠎ᠳ᠋ᠦ᠍ ᠳᠥᠷᠪᠡᠨ ᠰᠤᠩᠭᠤᠭᠳᠠᠬᠤᠨ᠎ᠲᠠᠢ ᠂ ᠲᠤᠰ ᠲᠤᠰ A ᠂ B ᠂ C ᠂ D ᠎ᠳᠦ ᠲᠡᠮᠳᠡᠭᠯᠡᠨ᠎ᠡ ᠃ ᠲᠠ ᠮᠡᠳᠡᠯᠭᠡ ᠪᠠ ᠵᠦᠢᠴᠢᠯᠡᠯ᠎ᠢ᠋ᠶ᠋ᠡᠨ ᠦᠨᠳᠦᠰᠦᠯᠡᠵᠦ ᠰᠡᠳᠦᠪ ᠪᠦᠷᠢ᠎ᠳ᠋ᠦ᠍ ᠨᠢᠭᠡ ᠬᠠᠮᠤᠭ ᠰᠠᠢᠨ ᠬᠠᠷᠢᠭᠤᠯᠲᠠ ᠥᠭᠭᠦᠭᠡᠷᠡᠢ ᠃

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q1}
A: {Choice1_1}
B: {Choice2_1}
C: {Choice3_1}
D: {Choice4_1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q2}
A: {Choice1_2}
B: {Choice2_2}
C: {Choice3_2}
D: {Choice4_2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q3}
A: {Choice1_3}
B: {Choice2_3}
C: {Choice3_3}
D: {Choice4_3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q4}
A: {Choice1_4}
B: {Choice2_4}
C: {Choice3_4}
D: {Choice4_4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q5}
A: {Choice1_5}
B: {Choice2_5}
C: {Choice3_5}
D: {Choice4_5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q6}
A: {Choice1_6}
B: {Choice2_6}
C: {Choice3_6}
D: {Choice4_6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ:
"""

ARC = """
ᠲᠠ ᠬᠡᠳᠦᠨ ᠣᠯᠠᠨ ᠰᠤᠩᠭᠤᠭᠳᠠᠬᠤᠨ᠎ᠲᠠᠢ ᠰᠣᠩᠭᠣᠯᠲᠠ᠎ᠶ᠋ᠢᠨ ᠰᠡᠳᠦᠪ᠎ᠢ᠋ ᠣᠯᠬᠤ ᠪᠣᠯᠤᠨ᠎ᠠ ᠃ ᠰᠡᠳᠦᠪ ᠨᠢᠭᠡᠪᠦᠷᠢ᠎ᠳ᠋ᠦ᠍ ᠳᠥᠷᠪᠡᠨ ᠰᠤᠩᠭᠤᠭᠳᠠᠬᠤᠨ᠎ᠲᠠᠢ ᠂ ᠲᠤᠰ ᠲᠤᠰ A ᠂ B ᠂ C ᠂ D ᠎ᠳᠦ ᠲᠡᠮᠳᠡᠭᠯᠡᠨ᠎ᠡ ᠃ ᠲᠠ ᠮᠡᠳᠡᠯᠭᠡ ᠪᠠ ᠵᠦᠢᠴᠢᠯᠡᠯ᠎ᠢ᠋ᠶ᠋ᠡᠨ ᠦᠨᠳᠦᠰᠦᠯᠡᠵᠦ ᠰᠡᠳᠦᠪ ᠪᠦᠷᠢ᠎ᠳ᠋ᠦ᠍ ᠨᠢᠭᠡ ᠬᠠᠮᠤᠭ ᠰᠠᠢᠨ ᠬᠠᠷᠢᠭᠤᠯᠲᠠ ᠥᠭᠭᠦᠭᠡᠷᠡᠢ ᠃

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q1}
A: {Choice1_1}
B: {Choice2_1}
C: {Choice3_1}
D: {Choice4_1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q2}
A: {Choice1_2}
B: {Choice2_2}
C: {Choice3_2}
D: {Choice4_2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q3}
A: {Choice1_3}
B: {Choice2_3}
C: {Choice3_3}
D: {Choice4_3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q4}
A: {Choice1_4}
B: {Choice2_4}
C: {Choice3_4}
D: {Choice4_4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q5}
A: {Choice1_5}
B: {Choice2_5}
C: {Choice3_5}
D: {Choice4_5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠠᠰᠠᠭᠤᠳᠠᠯ: {Q6}
A: {Choice1_6}
B: {Choice2_6}
C: {Choice3_6}
D: {Choice4_6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

HellaSwag = """
ᠲᠠ ᠨᠢᠭᠡ ᠬᠡᠰᠡᠭ ᠪᠦᠷᠢᠨ ᠪᠤᠰᠤ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠣᠷᠴᠢᠨ᠎ᠢ᠋ ᠣᠯᠵᠤ ᠦᠵᠡᠬᠦ ᠪᠣᠯᠤᠨ᠎ᠠ ᠂ ᠳᠠᠷᠠᠭ᠎ᠠ ᠨᠢ ᠳᠥᠷᠪᠡᠨ ᠪᠣᠯᠣᠯᠴᠠᠭᠠᠲᠤ ᠲᠡᠭᠦᠰᠬᠡᠯ᠎ᠦ᠋ᠨ ᠰᠤᠩᠭᠤᠭᠳᠠᠬᠤᠨ᠎ᠢ᠋ ᠣᠯᠭᠣᠨ᠎ᠠ ᠃ ᠲᠠᠨ᠎ᠤ᠋ ᠡᠭᠦᠷᠭᠡ ᠪᠣᠯ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠣᠷᠴᠢᠨ᠎ᠤ᠋ ᠯᠣᠭᠢᠭ ᠪᠣᠯᠤᠨ ᠶᠡᠷᠦ᠎ᠶ᠋ᠢᠨ ᠮᠡᠳᠡᠯᠭᠡ᠎ᠪᠡᠷ ᠬᠠᠮᠤᠭ᠎ᠤ᠋ᠨ ᠣᠨᠣᠪᠴᠢᠲᠠᠢ ᠂ ᠬᠠᠮᠤᠭ᠎ᠤ᠋ᠨ ᠬᠣᠯᠪᠣᠯᠲᠠ᠎ᠶ᠋ᠢᠨ ᠲᠡᠭᠦᠰᠬᠡᠯ᠎ᠢ᠋ ᠰᠣᠩᠭᠣᠬᠤ ᠶᠠᠪᠤᠳᠠᠯ ᠪᠣᠯᠤᠨ᠎ᠠ ᠃ ᠭᠠᠭᠴᠠ ᠬᠦ᠌ ᠨᠢᠭᠡ ᠰᠣᠩᠭᠣᠯᠲᠠ ᠨᠢ ᠬᠠᠮᠤᠭ᠎ᠤ᠋ᠨ ᠵᠦᠢ ᠶᠣᠰᠣᠨ᠎ᠤ᠋ ᠠᠷᠭ᠎ᠠ ᠮᠠᠶᠢᠭ᠎ᠢ᠋ᠶ᠋ᠠᠷ ᠡᠨᠡ ᠪᠠᠳᠠᠭ ᠦᠭᠡ᠎ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ᠎ᠢ᠋ ᠦᠷᠭᠦᠯᠵᠢᠯᠡᠭᠦᠯᠳᠡᠭ ᠃

ᠳᠡᠭᠡᠷ᠎ᠡ ᠳᠣᠣᠷᠠᠬᠢ ᠦᠭᠡ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ: {Q1}
A: {Choice1_1}
B: {Choice2_1}
C: {Choice3_1}
D: {Choice4_1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠳᠡᠭᠡᠷ᠎ᠡ ᠳᠣᠣᠷᠠᠬᠢ ᠦᠭᠡ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ: {Q2}
A: {Choice1_2}
B: {Choice2_2}
C: {Choice3_2}
D: {Choice4_2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠳᠡᠭᠡᠷ᠎ᠡ ᠳᠣᠣᠷᠠᠬᠢ ᠦᠭᠡ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ: {Q3}
A: {Choice1_3}
B: {Choice2_3}
C: {Choice3_3}
D: {Choice4_3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠳᠡᠭᠡᠷ᠎ᠡ ᠳᠣᠣᠷᠠᠬᠢ ᠦᠭᠡ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ: {Q4}
A: {Choice1_4}
B: {Choice2_4}
C: {Choice3_4}
D: {Choice4_4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠳᠡᠭᠡᠷ᠎ᠡ ᠳᠣᠣᠷᠠᠬᠢ ᠦᠭᠡ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ: {Q5}
A: {Choice1_5}
B: {Choice2_5}
C: {Choice3_5}
D: {Choice4_5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠳᠡᠭᠡᠷ᠎ᠡ ᠳᠣᠣᠷᠠᠬᠢ ᠦᠭᠡ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ: {Q6}
A: {Choice1_6}
B: {Choice2_6}
C: {Choice3_6}
D: {Choice4_6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

MNLI = """
ᠲᠠ ᠪᠣᠯ ᠨᠢᠭᠡᠨ ᠲᠤᠰᠬᠠᠢ ᠮᠡᠷᠭᠡᠵᠢᠯ᠎ᠦ᠋ᠨ ᠪᠠᠢᠭᠠᠯᠢ᠎ᠶ᠋ᠢᠨ ᠦᠭᠡ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠵᠦᠢᠴᠢᠯᠡᠯ᠎ᠦ᠋ᠨ ᠰᠢᠰᠲ᠋ᠧᠮ ᠮᠥᠨ ᠃ ᠤᠷᠢᠳᠠᠯ ᠪᠣᠯᠤᠨ ᠵᠢᠱ᠌ᠢᠯᠲᠡ ᠶᠢᠨ ᠬᠣᠭᠣᠷᠣᠨᠳᠣᠬᠢ ᠬᠠᠷᠢᠴᠠᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠮᠠᠭᠠᠳᠯᠠᠬᠤ᠎ᠶ᠋ᠢᠨ ᠬᠠᠮᠲᠤ ᠬᠠᠷᠠᠭᠠᠯᠵᠠᠭᠰᠠᠨ ᠲᠣᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠰᠢᠭᠤᠳ ᠭᠠᠷᠭᠠᠭᠠᠴᠢ ᠃

 — 0: ᠠᠬᠤᠭᠤᠯᠬᠤ
 — 1: ᠰᠠᠭᠠᠷᠮᠠᠭ
 — 2: ᠵᠥᠷᠢᠴᠡᠯ
 
0 ᠂ 1 ᠪᠤᠶᠤ 2 ᠡᠨᠡ ᠭᠤᠷᠪᠠᠨ ᠲᠣᠭᠠᠨ᠎ᠤ᠋ ᠨᠢᠭᠡ᠎ᠶ᠋ᠢ ᠯᠡ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠪᠠᠤ ᠂ ᠥᠭᠡᠷ᠎ᠡ ᠶᠠᠮᠠᠷ ᠴᠤ᠌ ᠠᠭᠤᠯᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠬᠤ ᠬᠡᠷᠡᠭ ᠥᠬᠡᠢ ᠃

ᠤᠷᠢᠳᠠᠯ: {P1}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠤᠷᠢᠳᠠᠯ: {P2}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠤᠷᠢᠳᠠᠯ: {P3}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠤᠷᠢᠳᠠᠯ: {P4}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠤᠷᠢᠳᠠᠯ: {P5}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠤᠷᠢᠳᠠᠯ: {P6}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

RTE = """
ᠲᠠ ᠪᠣᠯ ᠨᠢᠭᠡᠨ ᠲᠤᠰᠬᠠᠢ ᠮᠡᠷᠭᠡᠵᠢᠯ᠎ᠦ᠋ᠨ ᠪᠠᠢᠭᠠᠯᠢ᠎ᠶ᠋ᠢᠨ ᠦᠭᠡ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠵᠦᠢᠴᠢᠯᠡᠯ᠎ᠦ᠋ᠨ ᠰᠢᠰᠲ᠋ᠧᠮ ᠮᠥᠨ ᠃ ᠤᠷᠢᠳᠠᠯ ᠪᠣᠯᠤᠨ ᠵᠢᠱ᠌ᠢᠯᠲᠡ ᠶᠢᠨ ᠬᠣᠭᠣᠷᠣᠨᠳᠣᠬᠢ ᠬᠠᠷᠢᠴᠠᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠮᠠᠭᠠᠳᠯᠠᠬᠤ᠎ᠶ᠋ᠢᠨ ᠬᠠᠮᠲᠤ ᠬᠠᠷᠠᠭᠠᠯᠵᠠᠭᠰᠠᠨ ᠲᠣᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠰᠢᠭᠤᠳ ᠭᠠᠷᠭᠠᠭᠠᠴᠢ ᠃

 — 0: ᠠᠬᠤᠭᠤᠯᠬᠤ
 — 1: ᠵᠥᠷᠢᠴᠡᠯ
 
ᠵᠥᠪᠬᠡᠨ 0 ᠂ 1 ᠡᠨᠡ ᠬᠣᠶᠠᠷ ᠲᠣᠭᠠᠨ᠎ᠤ᠋ ᠨᠢᠭᠡ᠎ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠪᠠᠤ ᠂ ᠪᠤᠰᠤᠳ ᠶᠠᠮᠠᠷ ᠴᠤ᠌ ᠠᠭᠤᠯᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠬᠤ ᠬᠡᠷᠡᠭ ᠥᠬᠡᠢ ᠃

ᠤᠷᠢᠳᠠᠯ: {P1}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠤᠷᠢᠳᠠᠯ: {P2}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠤᠷᠢᠳᠠᠯ: {P3}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠤᠷᠢᠳᠠᠯ: {P4}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠤᠷᠢᠳᠠᠯ: {P5}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠤᠷᠢᠳᠠᠯ: {P6}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

QNLI = """
ᠲᠠ ᠪᠣᠯ ᠨᠢᠭᠡᠨ ᠲᠤᠰᠬᠠᠢ ᠮᠡᠷᠭᠡᠵᠢᠯ᠎ᠦ᠋ᠨ ᠪᠠᠢᠭᠠᠯᠢ᠎ᠶ᠋ᠢᠨ ᠦᠭᠡ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠵᠦᠢᠴᠢᠯᠡᠯ᠎ᠦ᠋ᠨ ᠰᠢᠰᠲ᠋ᠧᠮ ᠮᠥᠨ ᠃ ᠤᠷᠢᠳᠠᠯ ᠪᠣᠯᠤᠨ ᠵᠢᠱ᠌ᠢᠯᠲᠡ ᠶᠢᠨ ᠬᠣᠭᠣᠷᠣᠨᠳᠣᠬᠢ ᠬᠠᠷᠢᠴᠠᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠮᠠᠭᠠᠳᠯᠠᠬᠤ᠎ᠶ᠋ᠢᠨ ᠬᠠᠮᠲᠤ ᠬᠠᠷᠠᠭᠠᠯᠵᠠᠭᠰᠠᠨ ᠲᠣᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠰᠢᠭᠤᠳ ᠭᠠᠷᠭᠠᠭᠠᠴᠢ ᠃

 — 0: ᠠᠬᠤᠭᠤᠯᠬᠤ
 — 1: ᠵᠥᠷᠢᠴᠡᠯ
 
ᠵᠥᠪᠬᠡᠨ 0 ᠂ 1 ᠡᠨᠡ ᠬᠣᠶᠠᠷ ᠲᠣᠭᠠᠨ᠎ᠤ᠋ ᠨᠢᠭᠡ᠎ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠪᠠᠤ ᠂ ᠪᠤᠰᠤᠳ ᠶᠠᠮᠠᠷ ᠴᠤ᠌ ᠠᠭᠤᠯᠭ᠎ᠠ᠎ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠬᠤ ᠬᠡᠷᠡᠭ ᠥᠬᠡᠢ ᠃

ᠤᠷᠢᠳᠠᠯ: {P1}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠤᠷᠢᠳᠠᠯ: {P2}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠤᠷᠢᠳᠠᠯ: {P3}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠤᠷᠢᠳᠠᠯ: {P4}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠤᠷᠢᠳᠠᠯ: {P5}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠤᠷᠢᠳᠠᠯ: {P6}
ᠵᠢᠱ᠌ᠢᠯᠲᠡ: {H6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

AG_News = """
ᠴᠢ ᠪᠣᠯ ᠨᠢᠭᠡ ᠰᠣᠨᠢᠨ ᠮᠡᠳᠡᠭᠡᠨ᠎ᠦ᠌ ᠲᠥᠷᠥᠯ᠎ᠦ᠋ᠨ ᠲᠥᠷᠥᠯ ᠠᠩᠭᠢᠯᠠᠭᠴᠢ ᠃ ᠴᠢᠨᠦ ᠡᠭᠦᠷᠭᠡ ᠪᠣᠯ ᠰᠣᠨᠢᠨ ᠮᠡᠳᠡᠭᠡᠨ᠎ᠦ᠌ ᠳᠦᠷᠰᠦᠯᠡᠯ᠎ᠢ᠋ ᠦᠨᠳᠦᠰᠦᠯᠡᠨ ᠳᠣᠣᠷᠠᠬᠢ ᠳᠥᠷᠪᠡᠨ ᠲᠥᠷᠥᠯ᠎ᠳ᠋ᠦ᠍ ᠬᠤᠪᠢᠶᠠᠨ᠎ᠠ ᠃ ᠵᠥᠪᠬᠡᠨ ᠬᠠᠷᠠᠭᠠᠯᠵᠠᠭᠰᠠᠨ ᠱᠤᠰᠢᠭ᠎ᠠ᠎ᠶ᠋ᠢᠨ ᠲᠣᠭᠠᠨ᠎ᠳ᠋ᠤ᠌ ᠪᠤᠴᠠᠨ ᠂ ᠶᠠᠮᠠᠷᠴᠤ ᠢᠯᠡᠭᠦᠴᠡ ᠲᠠᠢᠯᠪᠤᠷᠢ ᠬᠢᠬᠦ ᠴᠢᠬᠤᠯᠠ ᠦᠭᠡᠢ ᠃

ᠡᠳᠡᠭᠡᠷ ᠲᠥᠷᠥᠯ ᠵᠦᠢᠯ᠎ᠳ᠋ᠦ᠍ ᠪᠠᠭᠲᠠᠬᠤ ᠨᠢ᠄
 — 1: ᠳᠡᠯᠡᠬᠡᠢ ᠶᠢᠷᠲᠢᠨᠴᠦ – ᠳᠡᠯᠡᠬᠡᠢ᠎ᠶ᠋ᠢᠨ ᠪᠤᠶᠤ ᠤᠯᠤᠰ ᠲᠥᠷᠥ᠎ᠶ᠋ᠢᠨ ᠰᠣᠨᠢᠨ ᠮᠡᠳᠡᠭᠡ
 — 2: ᠲᠠᠮᠢᠷ᠎ ᠤ᠋ᠨ ᠬᠥᠳᠡᠯᠭᠡᠭᠡᠨ – ᠲᠠᠮᠢᠷ᠎ᠲᠠᠢ ᠬᠣᠯᠪᠣᠭᠳᠠᠯ ᠪᠦᠬᠦᠢ ᠤᠷᠤᠯᠳᠤᠭᠠᠨ ᠪᠠ ᠦᠷ᠎ᠡ ᠳ᠋ᠦᠩ
 — 3: ᠬᠤᠳᠠᠯᠳᠤᠭ᠎ᠠ – ᠮᠥᠩᠭᠥᠨ ᠭᠦᠢᠯᠭᠡᠭᠡ ᠂ ᠠᠵᠤ ᠠᠬᠤᠢ ᠪᠤᠶᠤ ᠠᠵᠤ ᠠᠬᠤᠢᠯᠠᠯ᠎ᠤ᠋ᠨ ᠲᠤᠬᠠᠢ ᠰᠣᠨᠢᠨ ᠮᠡᠳᠡᠭᠡ
 — 4: ᠰᠢᠨᠵᠢᠯᠡᠬᠦ ᠤᠬᠠᠭᠠᠨ ᠮᠡᠷᠭᠡᠵᠢᠯ – ᠰᠢᠨᠵᠢᠯᠡᠬᠦ ᠤᠬᠠᠭᠠᠨ ᠪᠤᠶᠤ ᠲᠸᠭᠨᠢᠭ ᠮᠡᠷᠭᠡᠵᠢᠯ᠎ᠦ᠋ᠨ ᠬᠥᠭᠵᠢᠯᠲᠡ

ᠵᠥᠪᠬᠡᠨ ᠨᠢᠭᠡ ᠲᠣᠭ᠎ᠠ (᠎1 ᠂ 2 ᠂ 3 ᠪᠤᠶᠤ 4 )᠎ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠪᠠᠤ ᠂ ᠲᠤᠰ ᠲᠣᠭ᠎ᠠ ᠨᠢ ᠬᠠᠮᠤᠭ᠎ᠤ᠋ᠨ ᠲᠣᠬᠢᠷᠠᠮᠵᠢᠲᠠᠢ ᠲᠥᠷᠥᠯ᠎ᠢ᠋ ᠲᠥᠯᠥᠭᠡᠯᠡᠨ᠎ᠡ ᠃

ᠳᠦᠷᠰᠦᠯᠡᠬᠦ: {D1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠳᠦᠷᠰᠦᠯᠡᠬᠦ: {D2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠳᠦᠷᠰᠦᠯᠡᠬᠦ: {D3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠳᠦᠷᠰᠦᠯᠡᠬᠦ: {D4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠳᠦᠷᠰᠦᠯᠡᠬᠦ: {D5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠳᠦᠷᠰᠦᠯᠡᠬᠦ: {D6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

MRPC = """
ᠲᠠ ᠪᠣᠯ ᠨᠢᠭᠡᠨ ᠪᠠᠢᠭᠠᠯᠢ᠎ᠶ᠋ᠢᠨ ᠦᠭᠡ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠵᠦᠢᠴᠢᠯᠡᠯ᠎ᠳ᠋ᠦ᠍ ᠠᠩᠬᠠᠷᠤᠯ ᠲᠠᠯᠪᠢᠳᠠᠭ ᠲᠤᠰᠬᠠᠢ ᠮᠡᠷᠭᠡᠵᠢᠯᠲᠡᠨ ᠂ ᠲᠠᠨ᠎ᠤ᠋ ᠡᠭᠦᠷᠭᠡ ᠪᠣᠯ ᠬᠣᠶᠠᠷ ᠦᠭᠡ᠎ᠶ᠋ᠢᠨ ᠤᠳᠬ᠎ᠠ᠎ᠲᠠᠢ ᠠᠳᠠᠯᠢᠪᠲᠤᠷ ᠡᠰᠡᠬᠦ ᠃ ᠬᠡᠷᠪᠡ ᠠᠳᠠᠯᠢᠪᠲᠤᠷ ᠪᠣᠯ 0 ᠭᠠᠷᠭᠠᠨ᠎ᠠ ᠂ ᠬᠡᠷᠪᠡ ᠠᠳᠠᠯᠢ ᠦᠭᠡᠢ ᠪᠣᠯ 1 ᠭᠠᠷᠭᠠᠨ᠎ᠠ ᠃
 ᠴᠢᠨᠦ ᠬᠠᠷᠢᠭᠤᠯᠲᠠ ᠵᠥᠪᠬᠡᠨ 0 ᠪᠤᠶᠤ 1 ᠶ᠋ᠢ ᠭᠠᠷᠭᠠᠨ᠎ᠠ ᠂ ᠢᠯᠡᠭᠦᠴᠡ ᠲᠠᠢᠯᠪᠤᠷᠢᠯᠠᠯᠲᠠ ᠪᠤᠶᠤ ᠦᠭᠡ ᠬᠡᠯᠡ᠎ᠶ᠋ᠢ ᠪᠠᠭᠲᠠᠭᠠᠬᠤ ᠦᠭᠡᠢ ᠃

ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 1: {S1_1}
ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 2: {S2_1}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A1}}}

ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 1: {S1_2}
ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 2: {S2_2}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A2}}}

ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 1: {S1_3}
ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 2: {S2_3}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A3}}}

ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 1: {S1_4}
ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 2: {S2_4}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A4}}}

ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 1: {S1_5}
ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 2: {S2_5}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: \\boxed{{{A5}}}

ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 1: {S1_6}
ᠥᠭᠦᠯᠡᠪᠦᠷᠢ 2: {S2_6}
ᠬᠠᠷᠢᠭᠤᠯᠲᠠ: 
"""

CMMT = """
ᠲᠠ ᠪᠣᠯ ᠮᠣᠩᠭᠣᠯ ᠬᠡᠯᠡ ᠂ ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ᠎ᠶ᠋ᠢ ᠨᠡᠪᠲᠡᠷᠬᠡᠢ ᠣᠷᠴᠢᠭᠤᠯᠤᠭᠴᠢ ᠃ ᠲᠠᠨ᠎ᠤ᠋ ᠡᠭᠦᠷᠭᠡ ᠪᠣᠯ ᠮᠣᠩᠭᠣᠯ ᠥᠭᠦᠯᠡᠪᠦᠷᠢ᠎ᠶ᠋ᠢ ᠣᠨᠣᠪᠴᠢᠲᠠᠢ ᠮᠥᠷᠲᠡᠭᠡᠨ ᠰᠣᠨᠣᠰᠬᠤ᠎ᠳ᠋ᠤ᠌ ᠠᠶᠠᠲᠠᠢ ᠰᠠᠢᠬᠠᠨ ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ ᠳᠡᠭᠡᠷ᠎ᠡ ᠣᠷᠴᠢᠭᠤᠯᠬᠤ ᠪᠣᠯᠤᠨ᠎ᠠ ᠃ ᠪᠢᠲᠡᠭᠡᠢ ᠵᠠᠩᠭᠢ ᠨᠡᠮᠡᠬᠦ ᠪᠤᠶᠤ ᠲᠣᠪᠴᠢᠯᠠᠵᠤ ᠪᠠᠢ ᠃ ᠤᠳᠬ᠎ᠠ ᠂ ᠬᠡᠯᠡᠨ ᠵᠦᠢ ᠪᠠ ᠦᠭᠡ ᠬᠡᠯᠡᠨ᠎ᠦ᠌ ᠪᠠᠢᠳᠠᠯ᠎ᠢ᠋ᠶ᠋ᠠᠨ ᠦᠯᠡᠳᠡᠭᠡᠬᠦ᠎ᠳ᠋ᠦ᠍ ᠠᠩᠬᠠᠷᠤᠯ᠎ᠢ᠋ᠶ᠋ᠠᠨ ᠲᠥᠪᠯᠡᠷᠡᠭᠦᠯᠦᠭᠡᠷᠡᠢ ᠃

ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠣᠩᠭᠣᠯ ᠦᠰᠦᠭ: {M1}
ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ: \\boxed{{{C1}}}

ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠣᠩᠭᠣᠯ ᠦᠰᠦᠭ: {M2}
ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ: \\boxed{{{C2}}}

ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠣᠩᠭᠣᠯ ᠦᠰᠦᠭ: {M3}
Chinese: \\boxed{{{C3}}}

ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠣᠩᠭᠣᠯ ᠦᠰᠦᠭ: {M4}
ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ: \\boxed{{{C4}}}

ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠣᠩᠭᠣᠯ ᠦᠰᠦᠭ: {M5}
ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ: \\boxed{{{C5}}}

ᠤᠯᠠᠮᠵᠢᠯᠠᠯᠲᠤ ᠮᠣᠩᠭᠣᠯ ᠦᠰᠦᠭ: {M6}
ᠬᠢᠲᠠᠳ ᠬᠡᠯᠡ:
"""
